-DATASET CSV tinysnb

--

-CASE BasicAlgorithm
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL ParallelSPLength(PK, a, 2, 'nT1S') RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL ParallelSPLength(PK, a, 2, 'nT1S') RETURN a.fName, count(*);
---- 5
Alice|4
Bob|4
Carol|7
Dan|4
Elizabeth|13
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL ParallelSPLength(PK, a, 2, '1T1S') RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL ParallelSPLength(PK, a, 2, '1T1S') RETURN a.fName, count(*);
---- 5
Alice|4
Bob|4
Carol|7
Dan|4
Elizabeth|13
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL ParallelSPLength(PK, a, 2, 'nTkS') RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL ParallelSPLength(PK, a, 2, 'nTkS') RETURN a.fName, count(*);
---- 5
Alice|4
Bob|4
Carol|7
Dan|4
Elizabeth|13
-STATEMENT PROJECT IN_MEM GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL ParallelSPLength(PK, a, 2, 'nT1S') RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT IN_MEM GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL ParallelSPLength(PK, a, 2, 'nT1S') RETURN a.fName, count(*);
---- 5
Alice|4
Bob|4
Carol|7
Dan|4
Elizabeth|13
-STATEMENT PROJECT IN_MEM GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL ParallelSPLength(PK, a, 2, '1T1S') RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT IN_MEM GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL ParallelSPLength(PK, a, 2, '1T1S') RETURN a.fName, count(*);
---- 5
Alice|4
Bob|4
Carol|7
Dan|4
Elizabeth|13
-STATEMENT PROJECT IN_MEM GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID = 0 CALL ParallelSPLength(PK, a, 2, 'nTkS') RETURN a.fName, dst, length;
---- 4
Alice|0:1|1
Alice|0:2|1
Alice|0:3|1
Alice|0:4|2
-STATEMENT PROJECT IN_MEM GRAPH PK (person, knows) MATCH (a:person) WHERE a.ID < 10 CALL ParallelSPLength(PK, a, 2, 'nTkS') RETURN a.fName, count(*);
---- 5
Alice|4
Bob|4
Carol|7
Dan|4
Elizabeth|13