-NAME node1
-QUERY MATCH p=(a:person)-[:knows]->(b:person) RETURN a, path_length(p)
---- 1
8

-NAME node2
-QUERY MATCH (a:organisation) RETURN COUNT(*)
---- 1
3

