-NAME node1
-QUERY MATCH p=(a:person)-[:knows* SHORTEST]->(b:person) RETURN path_length(p)
---- 1
8

-NAME node2
-QUERY MATCH (a:organisation) RETURN COUNT(*)
---- 1
3

# MATCH p=(a:person)-[r:knows* SHORTEST]->(b:person) RETURN path_length(p) <- YES

Projection (length(p))
    --
Recursive Join
    --
Flatten
    --

Extend
Scan   Scan
(a-r)   (b)

